[
    {
        "title": "Gouda, Bacon And Leek Pancake",
        "ingredients": "8 Bacon slices|2 lg Leeks; (white and light green parts only), coarsely chopped|3 Eggs|3/4 c Milk|1/2 c All purpose flour|1 tb Dijon mustard|1/2 ts Sugar|1 c Firmly packed shredded Gouda; (about 4 ounces)",
        "servings": "1 servings",
        "instructions": "Preheat oven to 425F. Using heavy 10-inch nonstick ovenproof skillet, fry bacon over medium-high heat until brown and crisp. Transfer to paper towels to drain. Crumble bacon. Pour off all but 2 tablespoons bacon drippings from skillet. Add leeks to skillet and saute over medium heat until tender and beginning to brown, about 8 minutes. Combine eggs, milk, flour, mustard and sugar in processor and blend until smooth. Season with salt and pepper. Scatter bacon over leeks in skillet. Pour egg mixture over. Sprinkle Gouda over. Transfer to oven and bake until pancake puffs and cheese melts, about 15 minutes. Loosen pancake from skillet. Cut into wedges and serve. Serves 4."
    },
    {
        "title": "Grand Marnier Clementine Pancakes",
        "ingredients": "1 720 gram jar clementines in Grand Marnier; each clementine sliced into three, liquor reserved|50 g Unsalted butter; (2oz)|1 250 gram pac fresh French pancakes|Grand Marnier for flaming - optional; (see chef's tip)",
        "servings": "4 servings",
        "instructions": "Place the clementine slices in a bowl, then reduce the liquor by half in a saucepan over a moderate heat. Cool and combine with the clementines. Heat the serving plates. Melt a knob of the butter in a frying pan, then ladle in a portion of the clementines in liquor, allowing it to heat through gently. Place the first unfolded pancake on top of the clementines and give it time to warm through before folding it in half then half again to make a triangular shape. Transfer to a serving plate with the clementines on top. Repeat the above process until all the pancakes have been used. Serve immediately Notes Chef Tip'sTo flame the pancakessimply heat a ladle by holding it over a gas flame or resting it on the edge of the hotplate, then away from the heat source pour a little liqueur into it.Return it to the heat to warm the spirit, then set light to it! NOTES : A classic dessert comprising of pancakes and clementines in Grand Marnier."
    },
    {
        "title": "Mashed-Potato Pancakes",
        "ingredients": "2 c Mashed potatoes|1 lg Egg; beaten lightly|6 tb All-purpose flour|1 1/2 tb Grated onion|1/2 ts Dried marjoram; crumbled|1/3 c Chopped turkey liver if desired|Vegetable oil for frying the pancakes",
        "servings": "1 servings",
        "instructions": "In a bowl combine well the potatoes and the egg, stir in the flour thoroughly, and stir in the onion, the marjoram, the liver, and salt and pepper to taste. In a large heavy skillet heat 1/8 inch of the oil over moderately high heat until it is hot but not smoking and in it fry heaping tablespoons of the potato mixture, flattening them slightly with the back of the spoon, for 1 minute on each side, or until they are golden brown. Transfer the pancakes as they are cooked to paper towels to drain and if desired keep them warm on a rack set on a baking sheet in a preheated 250F. Serve the pancakes as an accompaniment to meat, poultry, or eggs. Serves 6 to 8."
    },
    {
        "title": "Melt in Your Mouth Pancakes",
        "ingredients": "1 c Buckwheat flour|1/2 c Unbleached or wholewheat pastry flour|1/2 pk Active dry yeast; ( 1 1/2 teas )|1/2 ts Salt; ( optional )|1 1/4 c Very warm water; ( about 100 f )|1/2 ts Baking soda|1 tb Molasses|1/4 c Very warm water",
        "servings": "1 servings",
        "instructions": "These Buckwheat pancakes are made with yeast, thereby making them light and fluffy and melt in your mouth tender . They do require an hour to rise so start the batter at least 1 1/2 hours before you plan to serve. Preheat oven to 200 degrees F, then turn it off. In a large bowl, mix buckwheat and unbleached flours, the yeast, and salt. Stir in 1 1/4 c of warm water and beat until smooth. Cover the bowl with a plate and place in preheated oven to rise until very bubbly, about 1 hour. ( be sure oven temp is off ! ) Dissolve the soda and molasses in 1/4 c of very warm water and add it to the buckwheat batter. Heat a nonstick skillet or griddle. Mist lightly with a vegetable spray. Pour small amounts of batter onto heated surface and cook until puffed and bubbly. Turn and cook the other side about 1 minute. Serve immediately with your desired topping. p.s. - I am a dedicated buckwheat lover ! Such a robust flavor ! I also add a shake or two of ground ginger and cinnamon to mine."
    },
    {
        "title": "Mini Pancakes with Chocolate Crispy Sauce",
        "ingredients": "250 g Plain flour; sifted (8oz)|1 md Size egg; beaten|300 ml Milk; ( 1/2 pint)|75 g Milk chocolate; (3oz)|142 ml Whipping cream; boiled or 100ml (3 1/2fl oz) milk, boiled (3 1/2fl oz)|50 g Marshmallows; or marshmallow pieces (2oz)|25 g Rice crispies or cornflakes; (1oz)|2 tb Vegetable oil",
        "servings": "4 servings",
        "instructions": "Place the flour into a mixing bowl. Gradually add the beaten egg and milk. Beat the batter until smooth. Allow the batter to stand for 30 minutes. In a separate bowl, melt the chocolate, add the hot cream, marshmallows and rice crispies and mix well. Pass the batter through a sieve. Lightly oil a non-stick frying pan using a piece of absorbent kitchen paper. Place the frying pan over a moderate heat and either ladle or pour some of the batter into the hot pan, enough to form a 10cm (4 inch) pancake. Cook for 1 minute on each side. It should be possible to cook 2-3 pancakes at one time. Keep the pancakes warm by covering them with kitchen foil. Re-oil the pan between each batch of pancakes. Serve the pancakes in stacks with the sauce poured over them. Notes : AlternativelyScotch pancakes could be used instead of making pancakes. If using Scotch pancakes warm them in the microwave or under the grill before serving. NOTES : An American stylenaughty but nicekiddies dessert."
    },
    {
        "title": "Honey-Apple Pancakes",
        "ingredients": "1 1/4 c All-purpose flour|2 ts Baking powder|1/4 ts Salt|1/4 ts Apple pie spice|1/8 ts Baking soda|1 Egg|3/4 c Apple juice|2 tb Honey|1 tb Cooking oil",
        "servings": "4 Servings",
        "instructions": "In a medium mixing bowl, stir flour, baking powder, salt, apple pie spice, and baking soda. In a small mixing bowl, beat egg slightly; stir in apple juice, honey, and oil. Add egg mixture all at once to flour mixture; stir until blended but still slightly lumpy. FOR EACH PANCAKE: Onto a hot, lightly greased griddle or skillet, pour about 1/4 cup batter. Cook 2 to 3 minutes or until pancakes have a bubbly surface and slightly dry edges. Turn and cook 2 to 3 minutes more or until golden brown. Makes 8, 4-inch pancakes. Recipe: Associated Press"
    },
    {
        "title": "Hootenanny Pancakes",
        "ingredients": "6 Eggs|1 c Milk|1/2 ts Salt|1 c Flour",
        "servings": "4 Servings",
        "instructions": "Combine eggs, milk and salt in blender and blend until fluffy. Tap flour into blender a little at a time. Beat with above ingredients. Melt 1 cube [8 tablespoons or 1/2 cup] butter or margarine in 9 inch by 13 inch glass dish in 450 degrees [fahrenheit] oven. (When butter is bubbly, pour in batter ... immediately return dish to oven) Bake 20-25 minutes on lower rack [of oven]. Lavish with heated maple syrup, fruit syrup, or jam. Good with sausage or bacon and fresh fruit cup. by Catherine Ann Schmitt. (JONATHAN C. HIGBEE)"
    },
    {
        "title": "Hootnany (German Pancakes)",
        "ingredients": "6 Eggs lightly beaten|1 c Milk|1 c Flour|1/2 ts Salt|1/2 Cube melted butter",
        "servings": "1 Servings",
        "instructions": "Directions: In a 9x13 melt butter Mix all other ingriedents together well but not beating. Very carfully pour in the pan with the melted butter, not mixing. Bake at 425 for 30 mins. Serve with Maple syrup or Buttermilk syrup Note: My aunt used to gather us around just befor taking it out or the oven and make us all say \"hootnany, hootnany, hoot hoot hoot\" before we could eat. Dont ask me why. My kids hate when I make them say it, but it brings back memories so we do it anyway."
    },
    {
        "title": "Chile Pancake Syrup Recipe",
        "ingredients": "15 Green New Mexico pods|5 Green Jalapeno pods|Hot peppers to taste|1 c Cider vinegar|1 c Grapefruit juice (reconstituted)|3 Cloves garlic; crushed|6 c Granulated sugar|1 Packet (dry) pectin (I used Sure-Jell; 1.75oz.)",
        "servings": "1 Servings",
        "instructions": "Split the jalapenos and clean as above. Chop the jalapenos into small pieces. No need to skin these. Put the NM chile, the jalapeno, and the crushed garlic together with 1/2 cup cider vinegar into a blender. Rev it up until it is liquified. Heat the sugar and 1/2 cup vinegar together and bring to a boil. Boil for about two minutes. Add the blended chile mix, and continue to boil for three or four minutes. Remove from heat. Stir the pectin together with 3/4 cup water in a separate pan. Bring to a boil, stirring constantly. Boil for one minute. Start this process before the sugar mixture is done, so you can put it in quickly. That is what your third hand is for. Add the pectin to the chile-sugar mixture. Add also the grapefruit juice. Stir it thoroughly, and allow it to cool enough for judicious tasting. Because of the way the chile pods were eviscerated, this syrup will have virtually no chile heat, but it will have a very pronounced chile flavor. It should be of a suitable consistency. If not, maybe you could boil it down or water it down until it is, although I do not know anything about boiling pectin after it is added."
    },
    {
        "title": "Beet Pancakes",
        "ingredients": "3 lg Eggs|3 md Beets; cooked, peeled, and grated|1/2 c Flour|1 pn Sugar|3 tb Finely chopped fresh dill; or 1-1/2 tsp. dried|Salt and freshly ground black pepper|Vegetable oil|Sour cream",
        "servings": "1 servings",
        "instructions": "1. In a medium bowl, whisk the eggs. Mix in the grated beets, flour, sugar, dill, and salt and pepper to taste. 2. Heat about 1/4-inch of oil in a large skillet over moderately high heat. For each pancake, place a heaping tablespoon of batter in the hot skillet. Use a spatula to press down on the batter to form flat pancakes, and cook about 1-1/2 minutes on each side. Serve with sour cream. Yield: 12 to 14 pancakes"
    }
]