[
    {
        "title": "Green Lasagna with Spinach And Ricotta",
        "ingredients": "O.evans vprj01a|1 1/2 c Parmesan cheese; grated|1 lb Spinach lasagna noodles|1 ts Salt|2 lb Fresh spinach; stemmed and|1/2 ts Pepper|Washed or...|1/4 ts Nutmeg; grated|2 pk Frozen chopped; (10 oz each)|1 lb Mozzarella cheese; cut into|Spinach|1/2 \" cubes|1 1/2 lb Ricotta cheese|4 c Tomato sauce|4 Egg yolks",
        "servings": "8 servings",
        "instructions": "Cook lasagna noodles and drain. Cool under cold running water; drain again and set aside. Preheat oven to 350F. In a large saucepan, cook spinach over medium-high heat, stirring frequently until leaves are limp 2-3 minutes. Drain spinach in a colander and press excess water out with the back of a wooden spoon. When cool enough to handle, squeeze dry. Turn spinach out onto a cutting surface and chop fine. In a large bowl, combine spinach, ricotta, egg yolks, 3/4 cup Parmesan cheese, salt, pepper and nutmeg. Mix with a wooden spoon until well blended. In a greased 13x9 inch baking dish, alternately layer spinach pasta with spinach - ricotta mixture and mozzarella, making a total four layers. Cover with foil and bake 25 minutes. Uncover and bake 10 minutes longer, or until tomato sauce and remaining Parmesan cheese on the side."
    },
    {
        "title": "Broccoli Shrimp Lasagna",
        "ingredients": "6 Lasagna noodles; uncooked|3 tb Margarine|1/4 c All-purpose flour|1/4 c Green onion; sliced|1/4 ts Salt|1/4 ts Dry mustard|1/4 ts Dried thyme|1/4 ts Cayenne pepper|2 1/2 c Milk; skim|1 c Monterey jack cheese; shredded|1 lb Broccoli flowerets|2 1/2 c Shredded cheddar cheese; lowfat, Healthy C|1 lb Shrimp; cooked, deveined",
        "servings": "8 Servings",
        "instructions": "Cook lasagna noodles to desired doneness as directed on package; drain. Rinse with hot water. Meanwhile, melt margarine in medium saucepan over medium heat. Stir in flour, onions, salt, dry mustard, thyme and ground red pepper. Gradually add milk, stirring constantly. Cook and stir until mixture is bubbly and thickened. Remove from heat. Add Monterey Jack cheese; stir until melted. Heat oven to 350°F. In ungreased 13x9-inch (3-quart) baking dish, layer 1/2 cup sauce, 3 noodles, all of the broccoli, 1/2 cup of the Cheddar cheese and 1 cup sauce. Top with remaining noodles, all of the shrimp, 1 cup of the Cheddar cheese, the remaining sauce and the remaining cheese. Bake for 30 minutes or until hot and bubbly. Let stand 10 minutes before serving. NOTES : Calories: 504.3 (22.3% from fat) Fat: 12.4g Cholesterol: 124mg Carbohydrate: 59g Fiber: 3.4g Sodium: 648mg"
    },
    {
        "title": "Vlf Lasagna",
        "ingredients": "12 Oven-ready lasagna noodles|1 Jar (32-oz.) of your favorite FF spaghetti sauce|1 pk (10-oz.) of LF silken tofu|1 tb Nutritional yeast|1 Zucchini, chopped|1/4 c TVP granules|2 ts Oregano|1 ts Garam-masala*|A few black olives, sliced|2 tb FF grated parmesan cheese (\"spaghetti cheese\")",
        "servings": "1 Servings",
        "instructions": "*garam-masala: Mine consists of black pepper, coriander, cumin, clove, cardamom, and cinnamon. I grind in a coffee grinder (reserved for spices, of course) and keep it on hand. Not an essential ingredient, but my family likes it (it's been my \"secret\" ingredient in spaghetti sauce for as long as I've been married--31 years!)."
    },
    {
        "title": "Habanero Lasagna",
        "ingredients": "1 cn Black olives (up to)|6 Habaneros (up to)|3 Cloves garlic|2 Boxes frozen spinach; defrost|Many; many cloves garlic|1 lb Light Ricotta|Commercial tomato sauce|1 cn (large) crushed tomatoes|Zucchini|Shredded Romano cheese",
        "servings": "8 Servings",
        "instructions": "We brought habanero lasagna: in food processor, night before - 1 can black olives, 4-6 habaneros, couple cloves garlic. Marinate in a little white wine overnight. When ready to make lasagna, take 2 boxes frozen spinach, defrost and saute with many many cloves of garlic. Mix the spinach and garlic with a pound of light ricotta. Then go ahead and make a lasagna, using the olive mixture as 2 layers and the spinach mixture as 2 layers. Ours was meatless, we used a commercial tomato sauce mixed with a large can of crushed tomatoes and also had a zucchini layer and a shredded romano cheese layer."
    },
    {
        "title": "Alyssa Milano's Rolled Lasagna",
        "ingredients": "1 pk Lasagna noodles; cooked|According to package; directions|1 c Cooked ham; chopped|3/4 c Ricotta cheese|1 c Spinach; cooked and chopped|3/4 c Mozzarella cheese; shredded|16 oz Spaghetti sauce",
        "servings": "6 servings",
        "instructions": "Drain lasagna noodles. Combine ham, spinach and both cheese in bowl. Spread the mixture on the lasagna and roll it up. Set in a baking dish and pour spaghetti sauce over it. Bake for 20 minutes. Sprinkle with Parmesan cheese, if desired. Serves 6. Alassa Milano, plays Tony Danza's lively daughter on \"Who's the Boss\"."
    },
    {
        "title": "Amateur Lasagna",
        "ingredients": "10 oz Frozen spinach|60 oz Spaghetti sauce; two 30 oz. jars|2 c Ricotta cheese; part skim milk|1 1/2 c Mozzarella cheese; part skim milk, shredded|1 Egg; beaten|8 oz Lasagna noodles|1/8 ts Black pepper|1/2 ts Oregano; optional|1/2 ts Basil; optional|1/2 c Vegetable juice cocktail|1/2 c Water",
        "servings": "10 servings",
        "instructions": "* Spaghetti sauce is available in a 30 ounce jar and also in smaller containers. For this recipe, I use about 1-1/2 to 2 jars of the Ragu Sauce in the 30 ounce container. 1. Thaw the spinach and squeeze dry. 2. In a large container mix the two cheeses, beaten egg, black pepper, oregano and basil. Add the thawed spinach and blend well. 3. Use a 13 x 9 inch pan. Put a small amount of the sauce in bottom and spread lightly to cover bottom. This keeps the lasagna from sticking as it cooks, and enables you to remove it easily in neat portions. 4. Place one third of the uncooked noodles, one third of the sauce and one third of the cheese-spinach mixture. Make 3 layers this way, ending with the sauce. 5. Combine the water and vegetable juice cocktail or tomato juice. Pour this carefully around the edges of the casserole, moving the noodles slightly with a spatula to get the liquid distributed evenly. Sprinkle with grated parmesan cheese if desired. 6. Cover tightly with foil. Bake at 350 degrees for 1 hour to 1 and 1/4 hours. Remove foil and continue baking for a few minutes more, until lightly browned and bubbling. 7. Let stand for at least 15 minutes before serving. This lasagna can be sliced with a flat edged spatula and lifted out in serving-sized portions. NOTES : I call this Amateur Lasagna because it does not require the noodles be cooked beforehand and uses ready-made spaghetti sauce. The addition of the spinach makes it a very nutritious dish. This freezes very well in serving sized portions, wrapped in foil; to heat, place in oven while still covered, or unwrap and heat in microwave on 30-50% power."
    },
    {
        "title": "Jiffy Lasagna Casserole",
        "ingredients": "1 lb Ground beef|10 Green onions; chopped|2 cn (8-oz) Hunt's tomato sauce with cheese|1 1/2 ts Salt|1/4 ts Oregano|1/4 ts Basil|1/8 ts Pepper|1 Clove garlic minced|1 pk (8-oz) wide noodles; cooked and drained|1 c Cottage cheese|1 c Dairy sour cream|1/4 c Minced parsley",
        "servings": "1 Servings",
        "instructions": "Brown and drain beef. Add onions and cook lightly. Ad Hunt's sauce, salt, oregano, basil, pepper, and garlic. Simmer five to ten minutes. Combine cooked noodles, cottage cheese, and sour cream in two-quart rectangular baking dish. Alternate layers of noodle mixture and sauce mixture, starting with noodle mixture and ending with sauce mixture. Bake at 350 25 to 30 minutes. Makes six servings."
    },
    {
        "title": "Joe Penny's Lasagna",
        "ingredients": "2 28 oz cans tomatoes|2 5 1-2 oz cans tomato paste|2 c Water|1/2 ts Basil|1/8 ts Crushed red pepper|1/2 ts Salt|1 ts Sugar|1 lb Lean ground beef|1 Clove garlic, minced|1 lb Sausage|1 lb Lasagna noodles|1 lb Ricotta cheese|1 Egg|1 tb Parsley|1 c Grated Parmesan cheese",
        "servings": "6 Servings",
        "instructions": "Combine the first 7 ingredients in a large pot and simmer 15 minutes. Saute' ground beef and garlic in a little oil. Add to tomato sauce. Cover and let simmer 3 hours on low heat, stirring occasionally. Brown sausage and slice in rounds. Preheat oven to 325 degrees. Cook noodles until al dente. Combine ricotta, egg and parsley in a bowl. Spread 1/3 of sauce on the bottom of a 12x8\" baking dish. Arrange alternately layers of noodles, ricotta, sausage, sauce and Parmesan, ending with Parmesan. Bake uncovered for 45 minutes. Let sit 5 minutes before serving."
    },
    {
        "title": "Seafood Lasagna #1",
        "ingredients": "8 Lasagna noodles|1 c Onions; chopped|2 tb Butter|1 pk (8-oz) cream cheese; softened|1 1/2 c Cream style cottage cheese|1 Egg; beaten|2 ts Dried basil; crushed|2 cn Cream of mushroom soup|1/3 c Milk|1/3 c Dry white wine|1 1/2 lb Shrimp; cooked, shelled and halved|1 lb White lump crabmeat|1/4 c Parmesan cheese; grated|1/2 c Sharp American cheese; shredded",
        "servings": "12 Servings",
        "instructions": "Cook Lasagna noodles according to package directions; drain. Arrange 4 noodles on the bottom of a greased l3x9x2-inch pyrex dish. Cook onion in butter until tender; blend in cream cheese. Stir in cottage cheese, egg, basil, salt and pepper. Spread half of this mixture atop noodles. Combine soup, milk and wine; stir in shrimp and crab. Spread half of this atop cheese layer. Repeat the layers. Sprinkle with Parmesan cheese. Bake uncovered in a 350 degree oven for 45 minutes. Top with American cheese and bake a few minutes longer until cheese melts. Can be frozen. Serves 12."
    },
    {
        "title": "Seafood Lasagna #2",
        "ingredients": "1/2 c Butter|1/2 c Flour|1/2 ts Salt|2 c Garlic; crushed|2 c Milk|2 c Chicken broth|1/4 ts Pepper|1 ts Basil|2 c Mozzarella cheese; shredded|1/2 c Green onions; chopped|15 Lasagna noodles; uncooked|1 c Cottage cheese; small curd|2/3 c Cooked shrimp cut bite size|2/3 c Cooked bay scallops bite siz|2/3 c Crabmeat cut bite size|1/3 c Dry white wine",
        "servings": "8 Servings",
        "instructions": "Patti Anderson, Prodigy Food & Wine Board MEAL-MASTER RECIPES LIST SERVER"
    }
]